#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ЛН_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УстановитьДоступностьФормыЗаказ(); 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьДоступностьФормыЗаказ()   
	
	ПолныеПраваУПользователя = РольДоступна("ПолныеПрава");
	МенеджерЗаказа = Объект.Менеджер; 
		
	Если ПолныеПраваУпользователя Или МенеджерЗаказа = Пользователи.ТекущийПользователь() Тогда 
		Возврат;
	Иначе
		ЭтаФорма.ТолькоПросмотр = Истина;  
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
