#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ЛН_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ИмяНовойКоманды = "УстановитьСтатусОтгруженДляВыделенныхСтрок";
	СоздатьКнопкуИКоманду(ИмяНовойКоманды, "Изменить статус на ""Отгружен""", Элементы.ФормаКоманднаяПанель); 
	
КонецПроцедуры  

#КонецОбласти          

#Область ОбработчикиКомандФормы    

&НаКлиенте
Процедура УстановитьСтатусОтгруженДляВыделенныхСтрок() 
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() > 0 Тогда 
		УстановитьСтатусОтгруженДляВыделенныхОрдеров(ВыделенныеСтроки); 
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусОтгруженДляВыделенныхОрдеров(ВыделенныеСтроки) 
	
	МассивОрдеров = СкладыСервер.ПроверитьОрдераНаВозможностьИзмененияСтатуса(ВыделенныеСтроки);
	Если МассивОрдеров.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из МассивОрдеров Цикл
		Объект = Строка.Ссылка.ПолучитьОбъект();
		ЗначенияРеквизитовДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ссылка, "ПометкаУдаления,Проведен"); 
		
		Если ЗначенияРеквизитовДокумента.ПометкаУдаления = Истина Тогда
			ШаблонТекстаСообщения = "Документ %1 помечен на удаление. Изменение статуса не возможно";
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонТекстаСообщения, Объект.Ссылка));
			Продолжить;
		КонецЕсли;  
		
		Объект.УстановитьСтатусОтгружен();		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьКнопкуИКоманду(ИмяКоманды, ЗаголовокКоманды, РасположениеКнопки)
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить(ИмяКоманды);
	НоваяКоманда.Заголовок = ЗаголовокКоманды;
	НоваяКоманда.Действие = ИмяКоманды; 
	НоваяКнопка = ЭтаФорма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), РасположениеКнопки);
	НоваяКнопка.ИмяКоманды	= ИмяКоманды; 
	
КонецПроцедуры       

#КонецОбласти
