#Область СлужебныеПроцедурыИФункции   

Процедура УстановитьСтатусОтгружен() Экспорт
	
	Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
	ДатаОтгрузки = ТекущаяДатаСеанса();
	
	Документы.РасходныйОрдерНаТовары.ЗаполнитьДействиеВСтроках(ЭтотОбъект);
	
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура();
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.РасходныйОрдерНаТовары);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект, ПараметрыУказанияСерий.ОтгружаемыеТовары);
	
	Попытка 
		Если Проведен Тогда
			ЭтотОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	Исключение 
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Статус документа %1 не изменен", Ссылка));
	КонецПопытки;	
	
КонецПроцедуры

#КонецОбласти
